# NOMINAL

In [3]:
import pandas as pd
from sklearn.preprocessing import OneHotEncoder

In [16]:
df=pd.DataFrame({"status":["single","married","seperated","single","married","married"]})

In [17]:
df

      status
0     single
1    married
2  seperated
3     single
4    married
5    married

In [18]:
encoder=OneHotEncoder()
nominalData=encoder.fit_transform(df[["status"]]).toarray()

In [19]:
nominalData

array([[0., 0., 1.],
       [1., 0., 0.],
       [0., 1., 0.],
       [0., 0., 1.],
       [1., 0., 0.],
       [1., 0., 0.]])

In [20]:
nominalDataDF=pd.DataFrame(nominalData,columns=encoder.get_feature_names_out(["status"]))

In [21]:
nominalDataDF

   status_married  status_seperated  status_single
0             0.0               0.0            1.0
1             1.0               0.0            0.0
2             0.0               1.0            0.0
3             0.0               0.0            1.0
4             1.0               0.0            0.0
5             1.0               0.0            0.0

In [22]:
pd.concat([df,nominalDataDF],axis=1)

      status  status_married  status_seperated  status_single
0     single             0.0               0.0            1.0
1    married             1.0               0.0            0.0
2  seperated             0.0               1.0            0.0
3     single             0.0               0.0            1.0
4    married             1.0               0.0            0.0
5    married             1.0               0.0            0.0

# LABEL

In [24]:
df=pd.DataFrame({"status":["single","married","seperated","single","married","married"]})

In [28]:
from sklearn.preprocessing import LabelEncoder
labelEncoder=LabelEncoder()
labelData=labelEncoder.fit_transform(df[["status"]])
labelDataDF=pd.DataFrame(labelData,columns=["status"])

C:\Users\hp\AppData\Roaming\Python\Python312\site-packages\sklearn\preprocessing\_label.py:110: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

In [29]:
labelDataDF

   status
0       2
1       0
2       1
3       2
4       0
5       0

In [31]:
pd.concat([df,labelDataDF],axis=1)

      status  status
0     single       2
1    married       0
2  seperated       1
3     single       2
4    married       0
5    married       0

# ORDINAL

In [32]:
from sklearn.preprocessing import OrdinalEncoder
df=pd.DataFrame({"qualification":["HS","GR","PHD","PG","HS","PHD","PHD","HS",]})

In [33]:
df

  qualification
0            HS
1            GR
2           PHD
3            PG
4            HS
5           PHD
6           PHD
7            HS

In [34]:
ordinal=OrdinalEncoder(categories=[["HS","GR","PHD","PG"]])
ordinalData=ordinal.fit_transform(df[["qualification"]])

In [35]:
ordinalData

array([[0.],
       [1.],
       [2.],
       [3.],
       [0.],
       [2.],
       [2.],
       [0.]])

In [36]:
ordinalDataDF=pd.DataFrame(ordinalData,columns=["qualOrd"])

In [38]:
pd.concat([df,ordinalDataDF],axis=1)

  qualification  qualOrd
0            HS      0.0
1            GR      1.0
2           PHD      2.0
3            PG      3.0
4            HS      0.0
5           PHD      2.0
6           PHD      2.0
7            HS      0.0

# TARGET GUIDED

In [39]:
data={"time":["lunch","breakfast","dinner","dinner","lunch","lunch","breakfast","dinner"],
      "bill":[120,145,165,172,186,197,121,155]}

In [40]:
df=pd.DataFrame(data)

In [41]:
df

        time  bill
0      lunch   120
1  breakfast   145
2     dinner   165
3     dinner   172
4      lunch   186
5      lunch   197
6  breakfast   121
7     dinner   155

In [42]:
mean_price=df.groupby("time")["bill"].mean().to_dict()

In [43]:
mean_price

{'breakfast': 133.0, 'dinner': 164.0, 'lunch': 167.66666666666666}

In [44]:
df["time_mean"]=df["time"].map(mean_price)

In [45]:
df

        time  bill   time_mean
0      lunch   120  167.666667
1  breakfast   145  133.000000
2     dinner   165  164.000000
3     dinner   172  164.000000
4      lunch   186  167.666667
5      lunch   197  167.666667
6  breakfast   121  133.000000
7     dinner   155  164.000000